[
    {
        "listing_id": 701645,
        "listing_name": "Starr Ranch Growers",
        "location_address": "Wenatchee, WA",
        "location_x": null,
        "location_y": null,
        "orgnization": "International Fresh Produce Association;Washington Apple Growers Marketing Association;",
        "listing_desc": "We are growers of apples, cherries and blueberries in central Washington state.  We offer direct deliveries to regional retailers, schools, healthcare facilities, and institutions with our products along with other Washington state grown fresh produce.  We also offer direct to consumer sales.  Farm tours are not available at this time."
    },
    {
        "listing_id": 701646,
        "listing_name": "Crabtree Farms of Chattanooga",
        "location_address": "1000 East 30th Street, Chattanooga, TN, USA",
        "location_x": -85.300271,
        "location_y": 35.0111974,
        "orgnization": "National Young Farmers Coalition;Southeast TN Chapter of the National Young Farmers Coaltion;Tennessee Association of Farmers Markets;Local Foods, Local Places Initiative;",
        "listing_desc": "Crabtree Farms was founded in 1998 to bring urban sustainable agriculture to Chattanooga. Our mission is to connect Chattanoogans with our local foodshed. We serve the greater Chattanooga community through education and advocacy programs that teach about growing food sustainably and choosing local produce. We produce sustainably-grown fruits, vegetables, and nursery stock, which we sell at the Main Street Farmers Market, at our seasonal on-site farm store, and to restaurants in downtown Chattanooga. Our Plant Sales, held in April and September each year, are a source of healthy-sustainably grown plant starts, live entertainment, and opportunities to shop for goods from local vendors. All are welcome to learn and work on the farm through our volunteer and internship programs, or by attending one of our many workshops. School groups are welcome."
    },
    {
        "listing_id": 701647,
        "listing_name": "Spindrift Orchard & Vineyard",
        "location_address": "34838 Cherrywood Lane, Polson, MT, USA",
        "location_x": -114.08936,
        "location_y": 47.7456671,
        "orgnization": null,
        "listing_desc": "We proudly grow USDA certified Organic Cherries and Wine Grapes on the pristine East Shore of Flathead Lake.  We conserve water and energy in our efficient, high density, pedestrian orchard system. We strive to provide the highest quality, most nutrient packed locally grown organic food. U-pick fruit and farm visits available during cherry season."
    }
]