[
    {
        "listing_id": 701645,
        "listing_name": "Starr Ranch Growers",
        "location_address": "Wenatchee, WA",
        "location_x": null,
        "location_y": null,
        "orgnization": "International Fresh Produce Association;Washington Apple Growers Marketing Association;",
        "listing_desc": "We are growers of apples, cherries and blueberries in central Washington state.  We offer direct deliveries to regional retailers, schools, healthcare facilities, and institutions with our products along with other Washington state grown fresh produce.  We also offer direct to consumer sales.  Farm tours are not available at this time."
    },
    {
        "listing_id": 701646,
        "listing_name": "Crabtree Farms of Chattanooga",
        "location_address": "1000 East 30th Street, Chattanooga, TN, USA",
        "location_x": -85.300271,
        "location_y": 35.0111974,
        "orgnization": "National Young Farmers Coalition;Southeast TN Chapter of the National Young Farmers Coaltion;Tennessee Association of Farmers Markets;Local Foods, Local Places Initiative;",
        "listing_desc": "Crabtree Farms was founded in 1998 to bring urban sustainable agriculture to Chattanooga. Our mission is to connect Chattanoogans with our local foodshed. We serve the greater Chattanooga community through education and advocacy programs that teach about growing food sustainably and choosing local produce. We produce sustainably-grown fruits, vegetables, and nursery stock, which we sell at the Main Street Farmers Market, at our seasonal on-site farm store, and to restaurants in downtown Chattanooga. Our Plant Sales, held in April and September each year, are a source of healthy-sustainably grown plant starts, live entertainment, and opportunities to shop for goods from local vendors. All are welcome to learn and work on the farm through our volunteer and internship programs, or by attending one of our many workshops. School groups are welcome."
    },
    {
        "listing_id": 701647,
        "listing_name": "Spindrift Orchard & Vineyard",
        "location_address": "34838 Cherrywood Lane, Polson, MT, USA",
        "location_x": -114.08936,
        "location_y": 47.7456671,
        "orgnization": null,
        "listing_desc": "We proudly grow USDA certified Organic Cherries and Wine Grapes on the pristine East Shore of Flathead Lake.  We conserve water and energy in our efficient, high density, pedestrian orchard system. We strive to provide the highest quality, most nutrient packed locally grown organic food. U-pick fruit and farm visits available during cherry season."
    },
    {
        "listing_id": 701652,
        "listing_name": "Howling Flats Farm",
        "location_address": "19 Raymond Avenue, North Canaan, Connecticut 06018",
        "location_x": -73.3552462,
        "location_y": 42.0103946,
        "orgnization": "FINE - Farm to Institution Network ;New CT Young Farmers Association ;",
        "listing_desc": "Howling Flats Farm is a small family farm in the NW Corner of Connecticut raising Certified Humane Grass fed Angus, pasture raised pork and lamb utilizing holistic management practices."
    },
    {
        "listing_id": 701656,
        "listing_name": "Allison Family Farm LLC",
        "location_address": "124 Diamond Lake Lane, Crescent City, FL, USA",
        "location_x": -81.5767371,
        "location_y": 29.423516,
        "orgnization": null,
        "listing_desc": "Allison Family Farm LLC is a U-Pick family farm located in Crescent City FL. We grow Pears, Persimmons, Olives, Figs, Grapes & Blackberries. We also sell wholesale in boxed lots. Together with the fruit we grow we also raise Ducks, Geese, Peacocks & Turkeys."
    },
    {
        "listing_id": 701648,
        "listing_name": "Goldenrust Farm",
        "location_address": "12503 County Road 9 E, Eyota, MN 55934",
        "location_x": null,
        "location_y": null,
        "orgnization": "Three Rivers Cattlemans;",
        "listing_desc": "Goldenrust Farm is a diversified livestock and crop farm, focused on growing delicious food for families. We currently produce beef, lamb, and pork on our farm north of Eyota, MN east of Rochester. We also sell extra hay and straw to keep our customer\\'s furry/woolly friends healthy and happy! Peter, Jess, and the rest of the #Farmily strive to produce the highest quality meats, while working hard to continue to leave the land better than we found it.\n\nA little bit about us:\nWe purchased our 40 acre farm in rural Olmsted County the Fall of 2011, and have been blessed with many adventures in love, life, and agriculture since then. Our farm just north of Eyota, Minnesota is currently the home to Peter & Jessica, three kids, a dog, a cat, chickens, beef, pigs, and sheep. Even with all the changes in the world a lot of things on a farm are very much the same. The miracles and hope we see every day growing local foods is something especially needed in the world today."
    },
    {
        "listing_id": 701658,
        "listing_name": "Sun Gold Farm, llc",
        "location_address": "6995 NW Evers Rd, Forest Grove, OR 97116",
        "location_x": null,
        "location_y": null,
        "orgnization": null,
        "listing_desc": "We are a small, sustainable family farm located in the beautiful, fertile Tualatin Valley near Forest Grove, Oregon, USA.  We are located near the small Dutch community of Verboort, where four generations before us have farmed and cared for the land that was once part of the Atfalati native tribe.  Our farm lies along West Dairy Creek, probably named because of the many dairies that used to be in this part of the county.  We have two natural wetlands on our farm and plenty of wildlife.  But mostly, we have vegetables, fruits, plants, and full days of work.  We are fortunate to enjoy what we do for a living!"
    },
    {
        "listing_id": 701659,
        "listing_name": "Moon River Ranch CSA",
        "location_address": "Ranch Lane, 45 Moon River Road, Clinton, MT, USA",
        "location_x": null,
        "location_y": null,
        "orgnization": null,
        "listing_desc": "Moon River Ranch CSA provides local, naturally grown produce to Bonner, Clinton, Drummond, Philipsburg, and Deer Lodge. Our CSA operates between June and October, offering convenient weekly pickups, add on products like meat, eggs, herbs, plant starts, salves, and seasonal fruit from local orchards. Our CSA offers two sizes depending on family size, and accept SNAP and Double SNAP benefits. "
    },
    {
        "listing_id": 701660,
        "listing_name": "Crosswinds Farm & Creamery",
        "location_address": "4721 New York 14A, Rock Stream, NY, USA",
        "location_x": -76.9658924,
        "location_y": 42.4606582,
        "orgnization": null,
        "listing_desc": null
    },
    {
        "listing_id": 701661,
        "listing_name": "The Twenty-Eight Eleven (The 2811)",
        "location_address": "211 Melaleuca Ln, Abbeville, SC 29620",
        "location_x": -82.416,
        "location_y": 34.174219,
        "orgnization": null,
        "listing_desc": "We are a family owned and run farm.  We have grass-fed cows, pastured pigs(Large Black crossed with Tamworth), egg-laying chickens, honeybees, and vegetables in the summer. We also sometimes raise meat chickens and turkeys."
    }
]