[
    {
        "listing_id": 1087,
        "listing_name": "Bundy Brook Farm, Reserve and Watershed LLC",
        "location_address": "RQ68+5W Mansfield, Connecticut",
        "location_x": null,
        "location_y": null,
        "orgnization": null,
        "listing_desc": "Our Farm is also home to one of Connecticut\\'s historic barns -- Ratcliff Barn.  Agroforestry at Bundy Brook Farm is an land-use management practice combining trees and shrubs with crops and or small livestock.  Approximately twenty acres of riparian forest and upland buffers with native trees, shrubs, forbs and grasses comprise Bundy Brook. This ecosystem enhances filtration of nutrients from surface run-off and shallow ground water.  It also protects the water quality of the Fenton River and is an effective tool for controlling erosion and providing food and cover for wildlife."
    },
    {
        "listing_id": 1083,
        "listing_name": "Crabtree Farms of Chattanooga",
        "location_address": "1000 East 30th Street, Chattanooga, TN, USA",
        "location_x": -85.3002714,
        "location_y": 35.0111974,
        "orgnization": "National Young Farmers Coalition;Southeast TN Chapter of the National Young Farmers Coaltion;Tennessee Association of Farmers Markets;Local Foods, Local Places Initiative;",
        "listing_desc": "Crabtree Farms was founded in 1998 to bring urban sustainable agriculture to Chattanooga. Our mission is to connect Chattanoogans with our local foodshed. We serve the greater Chattanooga community through education and advocacy programs that teach about growing food sustainably and choosing local produce. We produce sustainably-grown fruits, vegetables, and nursery stock, which we sell at the Main Street Farmers Market, at our seasonal on-site farm store, and to restaurants in downtown Chattanooga. Our Plant Sales, held in April and September each year, are a source of healthy-sustainably grown plant starts, live entertainment, and opportunities to shop for goods from local vendors. All are welcome to learn and work on the farm through our volunteer and internship programs, or by attending one of our many workshops. School groups are welcome."
    },
    {
        "listing_id": 1084,
        "listing_name": "Spindrift Orchard & Vineyard",
        "location_address": "34838 Cherrywood Lane, Polson, MT, USA",
        "location_x": -114.08936,
        "location_y": 47.7456671,
        "orgnization": null,
        "listing_desc": "We proudly grow USDA certified Organic Cherries and Wine Grapes on the pristine East Shore of Flathead Lake.  We conserve water and energy in our efficient, high density, pedestrian orchard system. We strive to provide the highest quality, most nutrient packed locally grown organic food. U-pick fruit and farm visits available during cherry season."
    },
    {
        "listing_id": 1091,
        "listing_name": "Fifer\\'s Farm Store & Kitchen",
        "location_address": "1919 Allabands Mill Rd, Camden Wyoming, DE 19934",
        "location_x": -75.571609,
        "location_y": 39.1208836,
        "orgnization": null,
        "listing_desc": "Fifer\\'s Farm Store and Kitchen is a 4th generation family farm that is located in Camden-Wyoming and offers U-pick, seasonal events, ice cream, lunch options, baked goods, fresh fruits, veggies and unique local foods.\n\nWe participate in Farmers’ Markets in Lewes (Saturdays) and Rehoboth Beach (Tuesdays). Our U-Pick crops feature: strawberries, blueberries, sunflowers, zinnias, peaches, apples and pumpkins (all when in-season only).\n\nWe also offer an 18-week CSA Farm Box Program (Community Supported Agriculture). This is a subscription based program that features many member benefits and new home delivery in addition to three Pickup locations."
    },
    {
        "listing_id": 1094,
        "listing_name": "Momma G Farms",
        "location_address": "36815 Leslye Ln, Eustis, FL 32736",
        "location_x": -81.5310469,
        "location_y": 28.885094,
        "orgnization": null,
        "listing_desc": "Momma G Farms offers free farm tours and classes. Our Farm has a food forest and other plants growing throughout farm where you can nibble as you tour. Contact farm to schedule field trips and classes. Text 407-591-0406 or call 352-357-0427"
    },
    {
        "listing_id": 1097,
        "listing_name": "Cedar Shake Farm",
        "location_address": "1823 225th St, Winterset, Iowa 50273",
        "location_x": -94.0843084885,
        "location_y": 41.3230331577,
        "orgnization": "Madison County Chamber;",
        "listing_desc": "We at Cedar Shake Farm are committed to providing locally-grown produce and flowers using sustainable and organic practices. We are not certified organic however, we strive to provide quality products while following those same practices. We use crop rotation as well as succession planting to provide a bountiful plethora of produce and flowers for your needs."
    },
    {
        "listing_id": 1098,
        "listing_name": "Skelly\\'s Farm Market",
        "location_address": "2713 S Hayner Rd, Janesville, WI 53548",
        "location_x": -89.0804503,
        "location_y": 42.6403842,
        "orgnization": "NAFDMA Agritourism Association;Wisconsin Ag Tourism Association;",
        "listing_desc": "Skelly\\'s Farm Market is open from June-Oct with homegrown strawberries in June, sweet corn, melons, tomatoes, and other summer produce in July-Aug, Skelly\\'s Sunflower Experience in late July lasting two weeks, and lots of fall fun including pumpkins, two awesome corn mazes, Choose-Your-Farm-Adventure wagons rides, and more. Plus, during all of our seasons visit our bakery with homemade donuts and more, our huge gift shop selling rustic decor, and our fantastic free playground. Plus, visit our 8 remote roadside stands for produce in July-Aug, and see us at the Saturday Janesville Farmers Market."
    },
    {
        "listing_id": 1100,
        "listing_name": "Crosswinds Farm & Creamery",
        "location_address": "4721 New York 14A, Rock Stream, NY, USA",
        "location_x": -76.9658924,
        "location_y": 42.4606582,
        "orgnization": null,
        "listing_desc": "On-farm retail store & scoop shop featuring our 100% grassfed Brown Swiss cows’ milk, cheese, yogurt & gelato -all produced right on the farm! Grassfed beef & pastured pork also raised on our family farm"
    },
    {
        "listing_id": 1101,
        "listing_name": "Verdant View Farm",
        "location_address": "429 Strasburg Road, Paradise, PA 17562",
        "location_x": null,
        "location_y": null,
        "orgnization": "FarmStayUS;PA Farm Bureau, PASA;DiscoverLancaster, Lancaster County Beekeeping Association, Lancaster County Farm Stay Group;",
        "listing_desc": "Rise and shine – slip on your boots and head to the barn for hands-on farm experience before a family-style breakfast. Milk a cow, collect eggs, interact with our many farm animals. and learn about our homestead farm.  Taste the difference of our pasture-raised beef, and enjoy recipes perfected with forty years of hosting meals at our farm B&B. Located in the heart of Amish Country in Lancaster County, PA, Verdant View Farm is owned and operated by 4th generation farmers."
    },
    {
        "listing_id": 1102,
        "listing_name": "Graceful Acres at Otter Creek Farm",
        "location_address": "189 Otter Creek Road, Johnsonville, NY, USA",
        "location_x": -73.5264057,
        "location_y": 42.8717964,
        "orgnization": "A Greener World, Animal Welfare Approved, 100% Grass-fed;",
        "listing_desc": "Come stay…\nEnjoy the grace of a historic family farm in the heart of eastern NY. Let the cool, fresh air and sounds of the outdoors start your day. Fill your time with a hike across our 440 acre farm then spend time with the animals and learn more about regenerative farming during a scheduled farm tour. Graceful Acres Farmstay is situated an hour south of the Adirondack State Park and within 35 minutes of Saratoga Springs, Albany, Troy, NY and Bennington, VT.\n\nAccommodations…\nEach site has a 10X12 canvas tent on a wooden deck large enough to provide a space to relax in an ADK chair under the awning in front of the tent. Inside the tent you will find a queen-sized mattress with luxury linens, drinking water, a woodstove, general cooking utensils including cast iron, tea pot, french press and more. Surrounding the tent is a picnic table, fire pit, grill grate, hammock, solar shower, non-potable water and a compost toilet."
    },
    {
        "listing_id": 1105,
        "listing_name": "The Silo House At Laughing Llama Farm",
        "location_address": "Deer Creek Road, Troy, TX, USA",
        "location_x": -97.240593,
        "location_y": 31.214426,
        "orgnization": null,
        "listing_desc": "Enjoy The Silo House At Laughing Llama farm, secluded and private,  conveniently located within 20 minutes to everything Waco, Temple &  Belton have to offer.  The Silo House is a renovated grain bin moved  from a family farm 50 miles away to it\\'s current location, The Laughing  Llama Farm in Troy.  The Silo House has an upstairs loft with a queen  sized bed & a queen sofa sleeper downstairs with a full bathroom  with shower downstairs - all making up a little over 600 square feet of  renovated modern artistic eclectic charm inside of a one of a kind silo  house.  There is a private outdoor shower under the stars.  Sit in the  rocking chairs by the chiminea on the front porch, grill steaks on the outdoor charcoal grill and watch the sun set over our little piece of Heaven.  Bring your own rods  and lures and fish in our pond or spend the morning watching the llamas  and the sheep graze while enjoying your coffee.  Private farm experiences and llama walks are available by appointment."
    }
]