[
    {
        "listing_id": 1087,
        "listing_name": "Bundy Brook Farm, Reserve and Watershed LLC",
        "location_address": "RQ68+5W Mansfield, Connecticut",
        "location_x": null,
        "location_y": null,
        "orgnization": null,
        "listing_desc": "Our Farm is also home to one of Connecticut\\'s historic barns -- Ratcliff Barn.  Agroforestry at Bundy Brook Farm is an land-use management practice combining trees and shrubs with crops and or small livestock.  Approximately twenty acres of riparian forest and upland buffers with native trees, shrubs, forbs and grasses comprise Bundy Brook. This ecosystem enhances filtration of nutrients from surface run-off and shallow ground water.  It also protects the water quality of the Fenton River and is an effective tool for controlling erosion and providing food and cover for wildlife."
    },
    {
        "listing_id": 1083,
        "listing_name": "Crabtree Farms of Chattanooga",
        "location_address": "1000 East 30th Street, Chattanooga, TN, USA",
        "location_x": -85.3002714,
        "location_y": 35.0111974,
        "orgnization": "National Young Farmers Coalition;Southeast TN Chapter of the National Young Farmers Coaltion;Tennessee Association of Farmers Markets;Local Foods, Local Places Initiative;",
        "listing_desc": "Crabtree Farms was founded in 1998 to bring urban sustainable agriculture to Chattanooga. Our mission is to connect Chattanoogans with our local foodshed. We serve the greater Chattanooga community through education and advocacy programs that teach about growing food sustainably and choosing local produce. We produce sustainably-grown fruits, vegetables, and nursery stock, which we sell at the Main Street Farmers Market, at our seasonal on-site farm store, and to restaurants in downtown Chattanooga. Our Plant Sales, held in April and September each year, are a source of healthy-sustainably grown plant starts, live entertainment, and opportunities to shop for goods from local vendors. All are welcome to learn and work on the farm through our volunteer and internship programs, or by attending one of our many workshops. School groups are welcome."
    },
    {
        "listing_id": 1084,
        "listing_name": "Spindrift Orchard & Vineyard",
        "location_address": "34838 Cherrywood Lane, Polson, MT, USA",
        "location_x": -114.08936,
        "location_y": 47.7456671,
        "orgnization": null,
        "listing_desc": "We proudly grow USDA certified Organic Cherries and Wine Grapes on the pristine East Shore of Flathead Lake.  We conserve water and energy in our efficient, high density, pedestrian orchard system. We strive to provide the highest quality, most nutrient packed locally grown organic food. U-pick fruit and farm visits available during cherry season."
    },
    {
        "listing_id": 1091,
        "listing_name": "Fifer\\'s Farm Store & Kitchen",
        "location_address": "1919 Allabands Mill Rd, Camden Wyoming, DE 19934",
        "location_x": -75.571609,
        "location_y": 39.1208836,
        "orgnization": null,
        "listing_desc": "Fifer\\'s Farm Store and Kitchen is a 4th generation family farm that is located in Camden-Wyoming and offers U-pick, seasonal events, ice cream, lunch options, baked goods, fresh fruits, veggies and unique local foods.\n\nWe participate in Farmers’ Markets in Lewes (Saturdays) and Rehoboth Beach (Tuesdays). Our U-Pick crops feature: strawberries, blueberries, sunflowers, zinnias, peaches, apples and pumpkins (all when in-season only).\n\nWe also offer an 18-week CSA Farm Box Program (Community Supported Agriculture). This is a subscription based program that features many member benefits and new home delivery in addition to three Pickup locations."
    },
    {
        "listing_id": 1094,
        "listing_name": "Momma G Farms",
        "location_address": "36815 Leslye Ln, Eustis, FL 32736",
        "location_x": -81.5310469,
        "location_y": 28.885094,
        "orgnization": null,
        "listing_desc": "Momma G Farms offers free farm tours and classes. Our Farm has a food forest and other plants growing throughout farm where you can nibble as you tour. Contact farm to schedule field trips and classes. Text 407-591-0406 or call 352-357-0427"
    },
    {
        "listing_id": 1097,
        "listing_name": "Cedar Shake Farm",
        "location_address": "1823 225th St, Winterset, Iowa 50273",
        "location_x": -94.0843084885,
        "location_y": 41.3230331577,
        "orgnization": "Madison County Chamber;",
        "listing_desc": "We at Cedar Shake Farm are committed to providing locally-grown produce and flowers using sustainable and organic practices. We are not certified organic however, we strive to provide quality products while following those same practices. We use crop rotation as well as succession planting to provide a bountiful plethora of produce and flowers for your needs."
    },
    {
        "listing_id": 1098,
        "listing_name": "Skelly\\'s Farm Market",
        "location_address": "2713 S Hayner Rd, Janesville, WI 53548",
        "location_x": -89.0804503,
        "location_y": 42.6403842,
        "orgnization": "NAFDMA Agritourism Association;Wisconsin Ag Tourism Association;",
        "listing_desc": "Skelly\\'s Farm Market is open from June-Oct with homegrown strawberries in June, sweet corn, melons, tomatoes, and other summer produce in July-Aug, Skelly\\'s Sunflower Experience in late July lasting two weeks, and lots of fall fun including pumpkins, two awesome corn mazes, Choose-Your-Farm-Adventure wagons rides, and more. Plus, during all of our seasons visit our bakery with homemade donuts and more, our huge gift shop selling rustic decor, and our fantastic free playground. Plus, visit our 8 remote roadside stands for produce in July-Aug, and see us at the Saturday Janesville Farmers Market."
    },
    {
        "listing_id": 1100,
        "listing_name": "Crosswinds Farm & Creamery",
        "location_address": "4721 New York 14A, Rock Stream, NY, USA",
        "location_x": -76.9658924,
        "location_y": 42.4606582,
        "orgnization": null,
        "listing_desc": "On-farm retail store & scoop shop featuring our 100% grassfed Brown Swiss cows’ milk, cheese, yogurt & gelato -all produced right on the farm! Grassfed beef & pastured pork also raised on our family farm"
    },
    {
        "listing_id": 1101,
        "listing_name": "Verdant View Farm",
        "location_address": "429 Strasburg Road, Paradise, PA 17562",
        "location_x": null,
        "location_y": null,
        "orgnization": "FarmStayUS;PA Farm Bureau, PASA;DiscoverLancaster, Lancaster County Beekeeping Association, Lancaster County Farm Stay Group;",
        "listing_desc": "Rise and shine – slip on your boots and head to the barn for hands-on farm experience before a family-style breakfast. Milk a cow, collect eggs, interact with our many farm animals. and learn about our homestead farm.  Taste the difference of our pasture-raised beef, and enjoy recipes perfected with forty years of hosting meals at our farm B&B. Located in the heart of Amish Country in Lancaster County, PA, Verdant View Farm is owned and operated by 4th generation farmers."
    },
    {
        "listing_id": 1102,
        "listing_name": "Graceful Acres at Otter Creek Farm",
        "location_address": "189 Otter Creek Road, Johnsonville, NY, USA",
        "location_x": -73.5264057,
        "location_y": 42.8717964,
        "orgnization": "A Greener World, Animal Welfare Approved, 100% Grass-fed;",
        "listing_desc": "Come stay…\nEnjoy the grace of a historic family farm in the heart of eastern NY. Let the cool, fresh air and sounds of the outdoors start your day. Fill your time with a hike across our 440 acre farm then spend time with the animals and learn more about regenerative farming during a scheduled farm tour. Graceful Acres Farmstay is situated an hour south of the Adirondack State Park and within 35 minutes of Saratoga Springs, Albany, Troy, NY and Bennington, VT.\n\nAccommodations…\nEach site has a 10X12 canvas tent on a wooden deck large enough to provide a space to relax in an ADK chair under the awning in front of the tent. Inside the tent you will find a queen-sized mattress with luxury linens, drinking water, a woodstove, general cooking utensils including cast iron, tea pot, french press and more. Surrounding the tent is a picnic table, fire pit, grill grate, hammock, solar shower, non-potable water and a compost toilet."
    },
    {
        "listing_id": 1105,
        "listing_name": "The Silo House At Laughing Llama Farm",
        "location_address": "Deer Creek Road, Troy, TX, USA",
        "location_x": -97.240593,
        "location_y": 31.214426,
        "orgnization": null,
        "listing_desc": "Enjoy The Silo House At Laughing Llama farm, secluded and private,  conveniently located within 20 minutes to everything Waco, Temple &  Belton have to offer.  The Silo House is a renovated grain bin moved  from a family farm 50 miles away to it\\'s current location, The Laughing  Llama Farm in Troy.  The Silo House has an upstairs loft with a queen  sized bed & a queen sofa sleeper downstairs with a full bathroom  with shower downstairs - all making up a little over 600 square feet of  renovated modern artistic eclectic charm inside of a one of a kind silo  house.  There is a private outdoor shower under the stars.  Sit in the  rocking chairs by the chiminea on the front porch, grill steaks on the outdoor charcoal grill and watch the sun set over our little piece of Heaven.  Bring your own rods  and lures and fish in our pond or spend the morning watching the llamas  and the sheep graze while enjoying your coffee.  Private farm experiences and llama walks are available by appointment."
    },
    {
        "listing_id": 1103,
        "listing_name": "Heritage Farm Alpacas & Events",
        "location_address": "4175 N 1200 W, Flora, IN 46929",
        "location_x": null,
        "location_y": null,
        "orgnization": "Farm Stay USA, Alpaca Owners Association, Suri Network;Indiana Alpaca Association;",
        "listing_desc": "We think of our farm as a little bit of ‘heaven on earth’ and we love to share it with others. Heritage Farm is a working alpaca farm with over 50 alpacas you can watch and interact with. Also residing on the farm are a flock of chickens and several goats. Make friends with our black Labrador, Juno anda few barn cats.\n​\nOur farm stay accommodations include a beautiful, well-appointed 3-bedroom guest house, a rustic 1850\\'s log cabin and a suspended tree house tent! Or, you can just bring your own tent or RV. You choose your level of comfort and adventure!\n\nIf you want, you can help with the daily chores of feeding the alpacas and collecting eggs. After that, explore the big red barn that was selected as one of the top-ten Bicentennial barns in the state. Roam around the 120 acre homestead, woods and creek and soak in the sights, sounds and smells of the farm."
    },
    {
        "listing_id": 1104,
        "listing_name": "Prairie Wind Farm",
        "location_address": "4507 Havemann Rd, Carmine TX   78932",
        "location_x": null,
        "location_y": null,
        "orgnization": "Farm Stay USA;Round Top Area Chamber of Commerce, Washington County Chamber of Commerce, Fayette County Tourism Association;",
        "listing_desc": "Prairie Wind Farm is a small family-owned business located on the rolling prairie of central Texas. It is a diversified farm with cattle, chickens, rabbits, and bed and breakfast accommodations. Guests are encouraged to tour the farm and participate in activities occurring during their stay."
    },
    {
        "listing_id": 1106,
        "listing_name": "The Inn at East Hill Farm",
        "location_address": "460 Monadnock Street, Troy, NH, USA",
        "location_x": -72.1445304,
        "location_y": 42.8390148,
        "orgnization": "Farm Stay USA;Monadnock Travel Council, Greater Keene and Peterborough Chamber of Commerce;",
        "listing_desc": "The Inn at East Hill Farm is a working farm and family vacation resort located at the foot of Mt. Monadnock in southern NH. Milk a cow, collect chicken eggs, ride a horse and feast on delicious homemade meals."
    },
    {
        "listing_id": 1108,
        "listing_name": "New Day Dairy GuestBarn",
        "location_address": "31000 175th St, Clarksville, IA, USA",
        "location_x": -92.6139878,
        "location_y": 42.7953704,
        "orgnization": "FarmStay USA;Midwest Dairy, Prairie Farms Cooperative;Iowa Farm Bureau;Waverly Chamber of Commerce;",
        "listing_desc": "#sleepwiththecows at New Day Dairy\\'s GuestBarn. Experience 24/7 cow gazing out our two large loft windows directly into the barn.  With three bedrooms each with their own private bathroom you\\'re family will have plenty of space. Every stay comes with our complimentary Intro & Farewell Tours where you can be up close with the cows, calves, and see Rita the Robot milking the cows! Head to NE Iowa for New Adventures, Authentic Cows, and Comfy Beds!"
    },
    {
        "listing_id": 1112,
        "listing_name": "Bellinger's Orchard LLC",
        "location_address": null,
        "location_x": null,
        "location_y": null,
        "orgnization": "NAFDMA;New York Apple Association, New York Farm Bureau;International Fruit Tree Association;",
        "listing_desc": "Our 300 acre farm offers PYO sweet & tart cherries, apples (over 50 varieties!), peaches, nectarines, pears, plums, pumpkins, and a challenging 5-acre corn maze with a scavenger hunt within! Our new farm market offers local fruits and vegetables, local honey, jams, fresh sweet cider, fudge, an on-site bakery, gifts by local artisans, and more.  Also offered are school and group tours (by reservation), 2 picnic areas,  and hayrides on the fall weekends."
    },
    {
        "listing_id": 1115,
        "listing_name": "Grow it Green Morristown",
        "location_address": "14 Maple Avenue, Morristown, NJ 07960",
        "location_x": -74.4821026,
        "location_y": 40.7950747,
        "orgnization": null,
        "listing_desc": "We have many opportunities at The Urban Farm and at our Early Street Community Garden. We are incredibly proud of the work that we do in educating our community and growing food sustainably. In 2021, The Urban Farm grew 30,000 pounds of produce and donated 11,000 pounds to local food pantries. We offer classes and volunteer opportunities for participants of all ages to learn about the benefits to growing your own food."
    },
    {
        "listing_id": 1096,
        "listing_name": "Dickie Bros. Orchard, LLC",
        "location_address": null,
        "location_x": null,
        "location_y": null,
        "orgnization": "Virginia Horticultural Society, Virginia Grown;",
        "listing_desc": "7th generation family owned farm, growing tree fruits, berries, vegetable, cattle. Offering pick your own in fall for apples and pumpkins. See website, www.dickiebros.com for full information on varieties and schedules etc."
    },
    {
        "listing_id": 1118,
        "listing_name": "Lanni Orchards Inc",
        "location_address": "294 Chase Rd, Lunenburg, MA, USA",
        "location_x": -71.7472898,
        "location_y": 42.6066617,
        "orgnization": "American Flowers Associations;North Central Chamber Commerce;",
        "listing_desc": "Interested in our CSA farm share program email us, and we will send you our CSA farm brochure"
    },
    {
        "listing_id": 1121,
        "listing_name": "Franklinton Farms Weekly Harvest Pack",
        "location_address": "154 Hawkes Avenue, Columbus, OH, USA",
        "location_x": -83.0249134,
        "location_y": 39.9561119,
        "orgnization": "OEFFA;",
        "listing_desc": "Franklinton Farms is a non-profit urban farm in Columbus, Ohio whose mission is to nourish neighborhood wellbeing and connection through farming, gardening, and education."
    },
    {
        "listing_id": 1125,
        "listing_name": "Twin Flame Lavender Farm",
        "location_address": "3849 Monroe Road, Allegan, MI, USA",
        "location_x": -85.9214384,
        "location_y": 42.5446159,
        "orgnization": "United States Lavender Growers Association;",
        "listing_desc": "Imagine walking in an organic lavender farm with the finest therapeutic and culinary Lavendula x angustifolia grown from seed. We grow from seed to ensure that no herbicide, pesticide or fertilizer has ever touched any of our lavender plants. Our lavender farm, \\\"Twin Flame Lavender Farm,\\\" is proud to offer you products to satisfy the lavender aficionado in your life.\n\nAll of our product recipes have been created by us. We use the products ourselves and have \\\"farm friends\\\" that test new products for us and provide feedback. We revisit, revise and perfect our recipes with the feedback we receive from our farm friends before we offer the product to the public for purchase! All of our product is curated onsite - no outsourcing.\n\nClasses held year round including lavender crafts and yoga.\n\nHours vary, check our website before venturing out to our farm!"
    },
    {
        "listing_id": 1126,
        "listing_name": "Fable:  From Farm to Table",
        "location_address": "1311 Kitchawan Road, Ossining, NY, USA",
        "location_x": -73.8140142,
        "location_y": 41.2116905,
        "orgnization": null,
        "listing_desc": "Fable is a farm and food hub dedicated to sustainable agriculture and education. We believe that through dedication, hard work, and modern technological advancements in agriculture, we can provide the freshest produce all year round without the use of harmful pesticides.\nFrom our farm to your table, Fable’s produce is sustainably grown in the Hudson Valley and truly set the standard of excellence in local fruit vegetable, and egg production."
    },
    {
        "listing_id": 1129,
        "listing_name": "Our Farm @ Roots Farm",
        "location_address": "1509 Crane Rd, Waxhaw, NC, USA",
        "location_x": -80.7845004,
        "location_y": 35.0014747,
        "orgnization": null,
        "listing_desc": "Intensive, Peri-urban Farm in Union County, NC offering fresh fruit, vegetables, herbs, cut flowers, honey, and mushrooms through our Harvest Box Subscriptions (with complete week-to-week customization). We also offer farm tours on request as well as workshops in small-scale ag."
    },
    {
        "listing_id": 1130,
        "listing_name": "Kai-Kai Farm",
        "location_address": "8006 Southwest Kanner Highway, Indiantown, FL, USA",
        "location_x": -80.3621313,
        "location_y": 27.0425139,
        "orgnization": "Florida Department of Agriculture and Consumer Services and Florida Agritourism Association;",
        "listing_desc": "Kai-Kai Farm promotes just and equitable food for our local communities by conserving natural resources, providing economic prices, and improve health outcomes. We have a unique variety of hospitality sites to choose from that support several operations such as our farm market, CSA, and farm to table dinners. Kai-Kai Farm is the first to operate an established farm market and CSA program in Indiantown, offering fresh produce to its neighbors. Our direct sale approach permits high quality communication and relationships between farmer and consumer. We are very fortunate to have cultivated close relationships with some of the best local chefs and restaurants in Palm Beach and Martin County. Kai-Kai Farm picturesque landscapes capture everyone\\'s vision and turns them into unforgettable memories. Our towering eucalyptus trees, flower fields, horizon views, and vegetables make for a selection of whimsical surroundings for all events and photoshoots."
    },
    {
        "listing_id": 1132,
        "listing_name": "The Storm Cellar",
        "location_address": null,
        "location_x": null,
        "location_y": null,
        "orgnization": "Colorado Association for Viticulture and Enology, Womens Wine Guild of Colorado;Valley Organic Growers Association, West Elks AVA, Hotchkiss Chamber of Commerce;",
        "listing_desc": "The Storm Cellar is a vineyard and winery located in Hotchkiss, Colorado, specializing in aromatic, dry white and rosé wines, crafted by the hands of two sommeliers, Jayme Henderson and Steve Steese.\n\nWe feature expansive outdoor seating at our tasting room, overlooking the West Elk mountains. From winemaker-led tastings to elaborate chef-hosted wine dinners, we embrace our roots in hospitality. Join us at our outdoor tasting room, overlooking the verdant North Fork Valley, located on the Western Slope of Colorado, home to an incredible array of organic farms and orchards, artisanal producers, and award-winning wineries within the West Elks AVA, where the mountains meet the mesas."
    },
    {
        "listing_id": 1138,
        "listing_name": "Baken Creek Farm CSA",
        "location_address": "6196 Waggoners Gap Road, Landisburg, PA, USA",
        "location_x": -77.289709,
        "location_y": 40.359966,
        "orgnization": null,
        "listing_desc": "A big part of the reason we started this farm was to provide an avenue for people to connect with their food and engage with nature. We feel very blessed to be able to steward this land, and want to share this blessing with the local community. We also realize that many people are unfamiliar with our farming practices and are interested in learning more--whether to better understand how their food is grown or to replicate these practices on their own land. We enjoy giving personalized tours and providing opportunities to visit throughout the year. We hope you can come visit sometime soon!\n\nCheck out our listing on HipCamp for tent camping at our farm, or reach out if you are interested in a scheduled farm tour."
    },
    {
        "listing_id": 1139,
        "listing_name": "Honey Down Farm",
        "location_address": "2629 Countryside Lane, Richfield, WI, USA",
        "location_x": -88.2755154,
        "location_y": 43.2864553,
        "orgnization": "American Dairy Goat association;Wisconsin beekeepers;4-H, FFA;",
        "listing_desc": "We have a small dairy goat farm in Richfield, Wisconsin. In spring we offer goat yoga. This is a fun tres relieving activity. You can register for a session on our website.\n\nWe also make goat milk soap and skin care products. For sale online and various brick and mortar."
    },
    {
        "listing_id": 1140,
        "listing_name": "North Meadow Farm",
        "location_address": "726 N Rd, Manchester, VT, USA",
        "location_x": -73.0451166,
        "location_y": 43.2029826,
        "orgnization": null,
        "listing_desc": "See how a real Vermont farm functions. See the animals, take a tour, try some cheese, and look around the store!"
    },
    {
        "listing_id": 1141,
        "listing_name": "The Forbes Family Farm",
        "location_address": "1900 W Sheep Creek Ranch Drive, Manila, Utah 84046",
        "location_x": -109.7226498,
        "location_y": 40.9880142,
        "orgnization": "Red Acre Center, Utah\\'s Own;",
        "listing_desc": "Stay in our cozy guest house or covered wagons on a working farm located along the Sheep Creek Geological Loop in Ashley National Forest. Only minutes away from the Flaming Gorge National Recreation Area with stream fishing, hiking, and bicycling opportunities within walking distance. This is the place for star gazers, outdoor adventurers, garden enthusiasts, and anyone looking to disconnect from the hustle and bustle. Come away to experience life on a working farm."
    },
    {
        "listing_id": 1146,
        "listing_name": "Prosperity family farm organics",
        "location_address": "4431 Shubert Avenue, Burton, MI, USA",
        "location_x": -83.6686068,
        "location_y": 42.9627777,
        "orgnization": null,
        "listing_desc": "I have a small farm with chickens Ducks tortoises a pig !you can walk my farm and relax thru out the land for a therapeutic experience. Its a beautiful unique getaway an oasis's that helped with my anxiety and depression. You can come pick fresh veggies or learn how to sustain for your family ! Volunteers are wanted community services are welcomed as well !!_x000d_\n"
    },
    {
        "listing_id": 1147,
        "listing_name": "Hope Farms Urban Agricultural Showcase and Training Center",
        "location_address": "10401 Scott Street, Houston, TX, USA",
        "location_x": -95.368292,
        "location_y": 29.6467189,
        "orgnization": "Slow Flowers;Tofga;",
        "listing_desc": "We invite everyone-residents, neighbors and tourists, to join our table and share your stories to spin the threads that connect generations, weaving the fabric of family and community.\n\nHope Farms is free to enjoy during regular weekly Market days; annual S.P.I.C.E. Guild Garden Party; Community Pot Lucks; annual Earth Day Family Festival and Picnic; First Wednesday Markets; Open Farms Days and many other Community events.  We also have several special ticketed and donor recognition events through the year that celebrate the harvest and help us support our mission to teach, empower and inspire healthy eating for all Houstonians, including seasonal sunset cocktails and farm walks and an annual 10-course dinner prepared by the city’s finest chefs. \n\nWe would be honored to help you throw a very special private party using our charming farm as your perfect venue for groups from 12-250.  Our location is especially convenient for your guests—just two miles from downtown."
    },
    {
        "listing_id": 1150,
        "listing_name": "BDA Farm",
        "location_address": "8661 Alabama 183, Uniontown, AL, USA",
        "location_x": -87.4516823,
        "location_y": 32.564682,
        "orgnization": "USDA, CCOF;AL Dep Ag and Industries;",
        "listing_desc": "At BDA Farm we aim to provide nutritious food in a sustainable and responsible way. \nWe practice Regenerative farming on Organic land and focus our management from the bottom up- understanding that good food starts with healthy soil. We focus on management and practices that restore instead of harm nature, observing and adapting as the natural cycles unfold; mimicking nature and functioning within the ecosystem, rather than manipulating it for mass production.\n- Come visit us for group tours and educational events to learn how we are restoring and protecting nature while providing sustainable food options.\n- Order Regenerative frozen Beef, Lamb, Pork, Beef Sticks, Raw Honey and more online and have it delivered to your door!"
    },
    {
        "listing_id": 1151,
        "listing_name": "Weimar Meat Company",
        "location_address": "2109 W HWY 90",
        "location_x": null,
        "location_y": null,
        "orgnization": null,
        "listing_desc": "We are farm to table producers. We raise beef and pork livestock. Our livestock are naturally, pasture raised with no added steroids or hormones and never leave the ranch until it is time to harvest. We own a state inspected processing plant where we harvest beef, pork, sheep and goat for our retail customers and other local farmers and ranchers."
    },
    {
        "listing_id": 1152,
        "listing_name": "Next to Nature Farm",
        "location_address": "23338 Kissinger Road, Leavenworth, KS 66048, USA",
        "location_x": -95.120218,
        "location_y": 39.181462,
        "orgnization": null,
        "listing_desc": "Next to Nature Farm is located in northeast Kansas, in between Lawrence and Kansas City. We are a small family farm committed to offering all of our products in their most natural form.  Next to Nature Farm strives to ensure a line of the highest quality products with an environmentally friendly focus. The farm is owned by Chad and Megan Gilliland. However, this farm operation is a family adventure and everyone pitches in including 10-year-old son (known as the Itty Bitty Beekeeper)! \nAt the agricultural and educational center, we will offer various classes and learning opportunities to find out more about bees, canning/preserving foods, pollinators, and small-scale agriculture. We will have a variety of products for sale, depending on the season. We are also home to \\\"Kansas\\' only honey tasting bar\\\" where you can try our delicious local honey, over a dozen varieties of infused and creamed honeys, and exotic flavors of honey from other regions."
    },
    {
        "listing_id": 1153,
        "listing_name": "North America Corporation",
        "location_address": "7000 Edwards Road, Denton, TX, USA",
        "location_x": -97.0622385,
        "location_y": 33.1775122,
        "orgnization": null,
        "listing_desc": null
    },
    {
        "listing_id": 1154,
        "listing_name": "Wild Haven Farm",
        "location_address": "41494 Poor Farm Road, North Branch, MN, USA",
        "location_x": -92.8377931,
        "location_y": 45.5491472,
        "orgnization": "Sustainable Farming Association, Livestock Conservancy, San Clemente Island Goat Breeders Association, American Poultry Association, American Pastured Poultry Producers Association;Fairshare CSA Coalition;Minnesota Farmers Union;",
        "listing_desc": "Wild Haven Farm is a certified organic family farm in Chisago County, MN focused on permaculture/regenerative farming methods and heritage livestock breeds. We provide poultry products (eggs, whole chicken) and specialty crops direct-to-consumer on the farm and through a year-round CSA with drop sites in the Twin Cities. Heritage goats and chickens are available as breeding stock. \n\nWild Haven Farm is a Minnesota Water Quality Certified Farm and is certified USDA Organic by MOSA."
    },
    {
        "listing_id": 1155,
        "listing_name": "Homesteads for Hope CSA",
        "location_address": "2185 Manitou Road, Rochester, NY, USA",
        "location_x": null,
        "location_y": null,
        "orgnization": "Care Farming Network;",
        "listing_desc": "Homesteads for Hope is a non-profit farm where our mission is to promote sustainable lifestyles and futures to create a collaborative community that serves adults with intellectual and developmental disabilities. We offer a half share (picked up bi-weekly) and a full share (picked up weekly) option. Each CSA purchase directly funds the continuation of our programs, the growth of our farm, and employment opportunities for adults with and without disabilities who want to work in agriculture.  For 20 weeks CSA members receive an abundance of vegetables that are grown using organic methods as well as weekly newsletters featuring letters from the farmer, recipes, storage techniques and more. We hope to see you in 2024!"
    },
    {
        "listing_id": 1158,
        "listing_name": "Roobeez",
        "location_address": "Penryn, CA, USA",
        "location_x": -121.1692868,
        "location_y": 38.8519794,
        "orgnization": null,
        "listing_desc": "Roobeez, is making it easier than ever to access fresh, locally sourced produce and support sustainable farming practices through online workshops and in-person Farm Expo events. At Roobeez, we are committed to promoting sustainable agriculture practices that benefit both farmers and our planet. By connecting consumers with local farms practicing organic farming methods or employing environmentally friendly techniques, we encourage responsible consumption while reducing carbon footprints. Our mission is to grow our local farmers, and grow the love for supporting our local farmers."
    },
    {
        "listing_id": 1160,
        "listing_name": "Big V Honey Bee at Jerry's",
        "location_address": "20797 S 4230 Rd, Claremore, OK 74019",
        "location_x": null,
        "location_y": null,
        "orgnization": "Oklahoma Department of Agriculture Food and Forestry Beekeepers Registration 667;American Indian Chamber of Comerce;",
        "listing_desc": "We have honey bee education for everybody.  Get up close or watch the bees on TV. We have great vendors and a petting zoo for the kids"
    },
    {
        "listing_id": 1161,
        "listing_name": "McCracken Farms",
        "location_address": "945 Harnage Road, Avon Park, FL 33825",
        "location_x": -81.4492266848,
        "location_y": 27.5363397496,
        "orgnization": null,
        "listing_desc": null
    },
    {
        "listing_id": 1164,
        "listing_name": "Ed Dunneback & Girl's Farm",
        "location_address": "025 6 mile Road, NW Grand Rapids, MI 49544",
        "location_x": -85.6704597782,
        "location_y": 43.058265528,
        "orgnization": null,
        "listing_desc": null
    },
    {
        "listing_id": 1165,
        "listing_name": "Corn Maze in Sauk Rapids",
        "location_address": "7110 Mayhew Lake Road NE, Sauk Rapids, MN 56379",
        "location_x": -94.1251830264,
        "location_y": 45.672825992,
        "orgnization": null,
        "listing_desc": null
    },
    {
        "listing_id": 1166,
        "listing_name": "Happy Day Farms Pumpkin Patch",
        "location_address": "Happy Day Dr. p o box 308, Terral, OK  73569",
        "location_x": -97.8982668105,
        "location_y": 33.8948289791,
        "orgnization": null,
        "listing_desc": null
    },
    {
        "listing_id": 1167,
        "listing_name": "Grandpa's Punkinberry Patch",
        "location_address": "10798 726 Road, Holdrege, NE 68949",
        "location_x": -99.4892129765,
        "location_y": 40.350792017,
        "orgnization": null,
        "listing_desc": null
    },
    {
        "listing_id": 1168,
        "listing_name": "Scasta Farm",
        "location_address": "2862 Old Boyce Road, Waxahachie, TX 75165",
        "location_x": -96.7337319612,
        "location_y": 32.3541600035,
        "orgnization": null,
        "listing_desc": null
    },
    {
        "listing_id": 1169,
        "listing_name": "Skål Farm",
        "location_address": "590 W. Colfax, Golden, CO 80401",
        "location_x": -105.1980276622,
        "location_y": 39.7213112688,
        "orgnization": null,
        "listing_desc": null
    },
    {
        "listing_id": 1170,
        "listing_name": "The Weedy Garden",
        "location_address": "215 N Bland Road, Dunlap, IL 61525",
        "location_x": -89.6489997141,
        "location_y": 40.8517852205,
        "orgnization": null,
        "listing_desc": null
    },
    {
        "listing_id": 1171,
        "listing_name": "Backyard Orchards",
        "location_address": "585 Northeast Hwy 431, Eufaula, AL 36027",
        "location_x": -85.1456770911,
        "location_y": 31.8991861378,
        "orgnization": null,
        "listing_desc": null
    },
    {
        "listing_id": 1172,
        "listing_name": "Drake Ridge Farms LLC",
        "location_address": "110 Bondsmill Road, Lawrenceburg, KY 40342",
        "location_x": -84.9149290407,
        "location_y": 37.9637303827,
        "orgnization": null,
        "listing_desc": null
    },
    {
        "listing_id": 1173,
        "listing_name": "Holly Creek Dairy",
        "location_address": "148 West Glenn Street, Zebulon, NC 27597",
        "location_x": -78.31705,
        "location_y": 35.82608,
        "orgnization": null,
        "listing_desc": null
    }
]